TuanAnhSatoh/STM32F103C8T6_UART/include/oled.h
#ifndef OLED_H
#define OLED_H

#include <stm32f103xe.h>
#include <pinmap.h>
#include <stdint.h>
#include <delay.h>
#include <fonts.h>
#include <gpio.h>
#include <i2c.h>
#include <string.h>

#define OLED_SCL_PORT    GPIOB
#define OLED_SCL_PIN     GPIO_PIN_6
#define OLED_SDA_PORT    GPIOB
#define OLED_SDA_PIN     GPIO_PIN_7

#define OLED_ADDRESS     (0x3C << 1) 
#define OLED_WIDTH       128
#define OLED_HEIGHT      64

typedef struct {
    uint16_t CurrentX;
    uint16_t CurrentY;
    uint8_t Inverted;
} OLED_t;

typedef enum {
    Black = 0x00, // Black color, no pixel
    White = 0x01  // Pixel is set. Color depends on OLED
} OLED_COLOR;

void OLED_Command(uint8_t cmd);
void OLED_Data(uint8_t data);
void OLED_Fill(OLED_COLOR color);
void OLED_UpdateScreen(void);
void OLED_Init(void);
void OLED_SetCursor(uint8_t x, uint8_t y);
void OLED_DrawPixel(uint8_t x, uint8_t y, OLED_COLOR color);
void OLED_WriteChar(char c, FontDef font, OLED_COLOR color);
void OLED_WriteString(const char* str, FontDef font, OLED_COLOR color);

#endif // OLED_H

